app/views/discos/_new.html.erb

SELECT "cantantes".* FROM "cantantes"
---
          <%= f.label "seleccione un cantante" %>
          <%= f.collection_select( :cantante_id,  Cantante.all, :id, :nombre, {:prompt => 'Lista de Cantantes'})   %>