app/controllers/cantantes_controller.rb

SELECT "cantantes".* FROM "cantantes"
---
  def index
    @cantantes = Cantante.all