app/controllers/discos_controller.rb

SELECT  "discos".* FROM "discos" WHERE "discos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cantantes".* FROM "cantantes" WHERE "cantantes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "cantantes".* FROM "cantantes" WHERE "cantantes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    if params[:cantante_id]
      @discos = Cantante.find(params[:cantante_id].to_i).discos
    else
      @discos = Disco.all

SELECT  "discos".* FROM "discos" WHERE "discos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @disco = Disco.find(params[:id])

SELECT  "discos".* FROM "discos" WHERE "discos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @disco = Disco.find(params[:id])

INSERT INTO "discos" ("nombre", "caracteristica", "created_at", "updated_at", "cantante_id") VALUES (?, ?, ?, ?, ?)  [["nombre", "fssdf"], ["caracteristica", "fds"], ["created_at", "2018-08-29 08:33:05.242722"], ["updated_at", "2018-08-29 08:33:05.242722"], ["cantante_id", 1]]
---
  def create
    @disco = Disco.new(disco_params)
    if @disco.save

SELECT  "discos".* FROM "discos" WHERE "discos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "discos" SET "caracteristica" = ?, "updated_at" = ? WHERE "discos"."id" = ?  [["caracteristica", "19749"], ["updated_at", "2018-08-28 14:38:45.713932"], ["id", 1]]
---
  def update
    @disco = Disco.find(params[:id])
    if @disco.update(disco_params)

SELECT  "discos".* FROM "discos" WHERE "discos"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "discos" WHERE "discos"."id" = ?  [["id", 11]]
---
 def destroy
   @disco = Disco.find(params[:id])
   @disco.destroy